# Import librairy

In [1]:
import pandas as pd

# Read the csv

In [14]:
df = pd.read_csv('random.csv', delimiter =';')

# Checking the first rows

In [15]:
df.head()

  First Name   Last Name  Gender   Age
0    Vanessa     Higgins  Female  27.0
1      Blake       Smith    Male  27.0
2      Kevin       Perry    Male   NaN
3       Myra       Craig  Female  21.0
4       Ryan  Cunningham    Male  22.0

# Checking the last rows

In [4]:
df.tail()

   First Name;Last Name;Gender;Age
95           Charlie;Lloyd;Male;18
96              Edwin;Ross;Male;21
97         Audrey;Holmes;Female;21
98             Luke;Miller;Male;24
99        Nicole;Perkins;Female;21

# Checking the structure

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 1 columns):
 #   Column                           Non-Null Count  Dtype
---  ------                           --------------  -----
 0   First Name;Last Name;Gender;Age  100 non-null    object
dtypes: object(1)
memory usage: 928.0+ bytes

# Checking the uniqueness of the values

In [16]:
df.isna().sum()

First Name    0
Last Name     2
Gender        1
Age           4
dtype: int64

# Checking the null values

In [18]:
df.isnull()

    First Name  Last Name  Gender    Age
0        False      False   False  False
1        False      False   False  False
2        False      False   False   True
3        False      False   False  False
4        False      False   False  False
..         ...        ...     ...    ...
95       False      False   False  False
96       False      False   False  False
97       False      False   False  False
98       False      False   False  False
99       False      False   False  False

[100 rows x 4 columns]

# Checking the missing values

In [19]:
df[df['Age'].isna()]

   First Name Last Name  Gender  Age
2       Kevin     Perry    Male  NaN
13    Valeria     Grant  Female  NaN
55       Tara     Owens     NaN  NaN
86       Carl       NaN    Male  NaN

In [22]:
df[df['Last Name'].isna()]

   First Name Last Name Gender   Age
51      Derek       NaN   Male  27.0
86       Carl       NaN   Male   NaN

In [23]:
df[df['Gender'].isna()]

   First Name Last Name Gender  Age
55       Tara     Owens    NaN  NaN

# Cleaning data

In [25]:
df1=df.dropna()

# Checking the results

In [26]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 95 entries, 0 to 99
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   First Name  95 non-null     object
 1   Last Name   95 non-null     object
 2   Gender      95 non-null     object
 3   Age         95 non-null     float64
dtypes: float64(1), object(3)
memory usage: 3.7+ KB

# Replacing the missing values instead of deleting them

In [27]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [30]:
df[df['Age'].isna()]

Empty DataFrame
Columns: [First Name, Last Name, Gender, Age]
Index: []

# Checking other values

In [31]:
df['Gender'].value_counts()

Female    51
Male      48
Name: Gender, dtype: int64

# Locating a range of people

In [46]:
df.loc[90:100]

90    20.0
91    25.0
92    20.0
93    24.0
94    20.0
95    18.0
96    21.0
97    21.0
98    24.0
99    21.0
Name: Age, dtype: float64

# Locating one cell

In [41]:
df.loc[82]

19.0